I ran into this myself and may have something for you. The API request to the AWS backend has a top-level `containerProperties` field, yes, but underneath Terraform is unmarshalling the JSON you provide into a type built on the `ContainerProperties` type in the underlying library https://pkg.go.dev/github.com/aws/aws-sdk-go@v1.42.44/service/batch#ContainerProperties.

Relevant line in the Terraform provider https://github.com/hashicorp/terraform-provider-aws/blob/a3c3027750444c59e022b46013f157c4446716d0/internal/service/batch/job_definition.go#L333
Relevant line wrapping the Golang AWS SDK type https://github.com/hashicorp/terraform-provider-aws/blob/a3c3027750444c59e022b46013f157c4446716d0/internal/service/batch/container_properties.go#L14

Neither type defines a public `containerProperties` field that the JSON can be unmarshalled into, so the result is an empty `ContainerProperties` struct. This is consistent with the `container_properties: planned value cty.NullVal(cty.String) does not match config value cty.StringVal(...` warning which, to me, indicates that the planned value is null.

When I ran into this, my terraform plan output looks something like 
```
Terraform will perform the following actions:

  # aws_batch_job_definition.test will be created
  + resource "aws_batch_job_definition" "test" {
      + arn                   = (known after apply)
      + id                    = (known after apply)
      + name                  = "hello_world_small_cpu"
      + platform_capabilities = [
          + "EC2",
        ]
      + propagate_tags        = true
      + revision              = (known after apply)
      + tags                  = {
          + "project" = "saptProduct"
        }
      + tags_all              = {
          + "terraform" = "true"
        }
      + type                  = "container"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
Note the missing `container_properties` attribute.

For my Terraform, I fixed this by using the fields defined here https://docs.aws.amazon.com/batch/latest/APIReference/API_ContainerProperties.html as the top-level fields in my JSON object. My JSON template file looks something like
```
${jsonencode({
    "image": "${image_name}",
    "command": cmd,
    "resourceRequirements": [
        {
            "type": "MEMORY",
            "value": "${cntr_memory}"
        },
        {
            "type": "VCPU",
            "value": "${cntr_vcpus}"
        }
  ],
  "type": "container",
  "jobDefinitionName": "${def_name}"
})}
```